In [1]:
import numpy as np
import pandas as pd
from pathlib import Path
from collections import Counter
from sklearn.model_selection import train_test_split
from imblearn.metrics import classification_report_imbalanced
from sklearn.metrics import accuracy_score
from sklearn.metrics import balanced_accuracy_score
from sklearn.metrics import confusion_matrix, classification_report
from sklearn.ensemble import RandomForestClassifier
from sklearn.linear_model import LogisticRegression
from imblearn.ensemble import EasyEnsembleClassifier
from sklearn.preprocessing import StandardScaler
import sqlalchemy as db
from sqlalchemy import MetaData
from sqlalchemy import create_engine
from collections import Counter
import plotly.express as px

In [2]:
engine = create_engine('postgresql+psycopg2://postgres:Ehsan$2694@localhost/cafe')

In [3]:
customer_df = pd.read_sql_table('customer_info', con=engine)
customer_df.head()

,cust_id,cust_gender,cust_age,cust_income,cust_q1_taste,cust_q2_price,cust_q3_calories
0,3923,1,26,NaN,4,4,1
1,4389,0,34,11190.0,1,4,1
2,20984,0,46,91292.0,5,5,1
3,6776,1,47,89551.0,3,4,2
4,16515,1,43,64310.0,4,3,2

In [4]:
order_df = pd.read_sql_table('order_info', con=engine)
order_df.head()

,cust_id,store_ID,month,day,transaction,food,drink,drink_type,drink_size,drink_milk,drink_calories,drink_price,food_type,food_calories,food_price,total_spend
0,3923,501,4,5,6705,1,1,Drip Coffee,Medium,None,5,2.05,Grand Slam Cookie,280,2.00,4.05
1,4389,501,1,26,1627,1,1,Drip Coffee,Small,None,4,1.75,Rice Krispie Square,240,1.95,3.70
2,20984,501,9,4,16568,0,1,Drip Coffee,Medium,None,5,2.05,None,0,NaN,2.05
3,6776,501,6,23,11070,0,1,Drip Coffee,Medium,None,5,2.05,None,0,NaN,2.05
4,16515,501,11,25,21285,1,0,None,None,None,0,NaN,Biscotti,280,2.20,2.20

In [5]:
data = customer_df.merge(order_df.drop('cust_id', 1), left_index=True, right_index=True)
data.head()

,cust_id,cust_gender,cust_age,cust_income,cust_q1_taste,cust_q2_price,cust_q3_calories,store_ID,month,day,...,drink,drink_type,drink_size,drink_milk,drink_calories,drink_price,food_type,food_calories,food_price,total_spend
0,3923,1,26,NaN,4,4,1,501,4,5,...,1,Drip Coffee,Medium,None,5,2.05,Grand Slam Cookie,280,2.00,4.05
1,4389,0,34,11190.0,1,4,1,501,1,26,...,1,Drip Coffee,Small,None,4,1.75,Rice Krispie Square,240,1.95,3.70
2,20984,0,46,91292.0,5,5,1,501,9,4,...,1,Drip Coffee,Medium,None,5,2.05,None,0,NaN,2.05
3,6776,1,47,89551.0,3,4,2,501,6,23,...,1,Drip Coffee,Medium,None,5,2.05,None,0,NaN,2.05
4,16515,1,43,64310.0,4,3,2,501,11,25,...,0,None,None,None,0,NaN,Biscotti,280,2.20,2.20

In [6]:
data.isnull().sum()

cust_id                 0
cust_gender             0
cust_age                0
cust_income          6541
cust_q1_taste           0
cust_q2_price           0
cust_q3_calories        0
store_ID                0
month                   0
day                     0
transaction             0
food                    0
drink                   0
drink_type           3468
drink_size           3468
drink_milk          30289
drink_calories          0
drink_price          3468
food_type           41374
food_calories           0
food_price          41374
total_spend             0
dtype: int64

In [7]:
data.dropna(subset=['cust_income'], inplace=True)

In [8]:
columns_to_drop = [i for i in data.columns.tolist() if (i[:5]=='drink')]
columns_to_drop.append('total_spend')
columns_to_drop

['drink',
 'drink_type',
 'drink_size',
 'drink_milk',
 'drink_calories',
 'drink_price',
 'total_spend']

In [9]:
food = data.dropna(subset=['food_type']).drop(columns=columns_to_drop)

In [10]:
food.isnull().sum()

cust_id             0
cust_gender         0
cust_age            0
cust_income         0
cust_q1_taste       0
cust_q2_price       0
cust_q3_calories    0
store_ID            0
month               0
day                 0
transaction         0
food                0
food_type           0
food_calories       0
food_price          0
dtype: int64

In [11]:
food.head()

,cust_id,cust_gender,cust_age,cust_income,cust_q1_taste,cust_q2_price,cust_q3_calories,store_ID,month,day,transaction,food,food_type,food_calories,food_price
1,4389,0,34,11190.0,1,4,1,501,1,26,1627,1,Rice Krispie Square,240,1.95
4,16515,1,43,64310.0,4,3,2,501,11,25,21285,1,Biscotti,280,2.20
12,8849,1,39,51020.0,1,3,1,501,5,18,9406,1,Banana Chocolate Muffin,190,1.90
14,35216,0,25,13411.0,5,1,5,501,1,4,142,1,Cupcake,395,2.90
26,13249,0,41,69849.0,5,3,1,501,2,3,2083,1,Rice Krispie Square,240,1.95

In [12]:
food["food_type"].replace({
    "Rice Krispie Square": 1, 
    "Biscotti": 2,
    'Banana Chocolate Muffin': 3,
    'Cupcake': 4,
    'Blueberry Scone': 5,
    'Grand Slam Cookie': 6,
    'Croissant': 7,
    'Breakfast Sandwich': 8,
    'Iced Carrot Cake': 9,
    'Naniamo Bar': 10,
    'Maple Scone': 11,
    'Bagel and Cream Cheese': 12,
    'Chunky Chocolate Cookie': 13,
}, inplace=True)

In [13]:
food.shape

(11630, 15)

In [14]:
food.food_price.value_counts()

2.05    2144
2.90    2092
2.00    1562
2.20    1388
2.95    1129
3.95    1046
1.90     835
2.40     769
1.95     665
Name: food_price, dtype: int64

In [15]:
sorted(food.food_price.unique())

[1.9, 1.95, 2.0, 2.05, 2.2, 2.4, 2.9, 2.95, 3.95]

In [16]:
sorted(food.food_calories.unique())

[190, 240, 270, 280, 345, 351, 395, 400]

In [17]:
food['calories_importance'] = food.food_calories.apply(lambda x: '1' if x<200  else '2' if 200<=x<250  else '3' if 250<=x<350  else '4' if 350<=x<400 else "5")
food['price_importance'] = food.food_price.apply(lambda x: '1' if x<2 else '2' if 2<=x<2.2  else '3' if 2.2<=x<2.5  else '4' if 2.5<=x<3 else "5")
food['cust_income_range'] = pd.cut(food['cust_income'], bins=[0, 25000, 50000, 75000, 100000, 125000, 150000, 175000, 500000], include_lowest=True, labels=[1,2,3,4,5,6,7,8])

In [18]:
food.head()

,cust_id,cust_gender,cust_age,cust_income,cust_q1_taste,cust_q2_price,cust_q3_calories,store_ID,month,day,transaction,food,food_type,food_calories,food_price,calories_importance,price_importance,cust_income_range
1,4389,0,34,11190.0,1,4,1,501,1,26,1627,1,1,240,1.95,2,1,1
4,16515,1,43,64310.0,4,3,2,501,11,25,21285,1,2,280,2.20,3,3,3
12,8849,1,39,51020.0,1,3,1,501,5,18,9406,1,3,190,1.90,1,1,3
14,35216,0,25,13411.0,5,1,5,501,1,4,142,1,4,395,2.90,4,4,1
26,13249,0,41,69849.0,5,3,1,501,2,3,2083,1,1,240,1.95,2,1,3

In [19]:
food.calories_importance.value_counts()

3    5863
4    2800
1    1173
5    1129
2     665
Name: calories_importance, dtype: int64

In [20]:
food.price_importance.value_counts()

2    3706
4    3221
3    2157
1    1500
5    1046
Name: price_importance, dtype: int64

In [21]:
food.cust_income_range.value_counts()

3    3115
2    2908
4    2319
1    1532
5     997
8     329
6     299
7     131
Name: cust_income_range, dtype: int64

In [22]:
X = food.drop(['cust_id', 'transaction', 'food',
 'store_ID',
 'food_calories', 
'food_price',
  'cust_q2_price', 
  'cust_q3_calories', 
  'cust_income', 
  'food_type'],1)
y = food.food_type.values
X.head()

,cust_gender,cust_age,cust_q1_taste,month,day,calories_importance,price_importance,cust_income_range
1,0,34,1,1,26,2,1,1
4,1,43,4,11,25,3,3,3
12,1,39,1,5,18,1,1,3
14,0,25,5,1,4,4,4,1
26,0,41,5,2,3,2,1,3

In [23]:
# X = pd.get_dummies(X, columns=['calories_range', 'price_range'])

In [24]:
# X = pd.get_dummies(X, columns=['month', 'day', 'cust_q1_taste', 'cust_q2_price', 'cust_q3_calories'])

In [25]:
# X = pd.get_dummies(X, columns=['store_ID'])

In [26]:
# X.head()

In [28]:
# Counter(y)

In [29]:

X_train, X_test, y_train, y_test = train_test_split(X,y,  random_state=1, stratify=y)
X_train.shape

(8722, 8)

In [30]:
Counter(y_train)

Counter({1: 499,
         3: 626,
         2: 1041,
         12: 847,
         11: 361,
         5: 1247,
         13: 524,
         4: 731,
         8: 784,
         9: 584,
         6: 647,
         10: 254,
         7: 577})

In [31]:
scaler = StandardScaler()

X_scaler = scaler.fit(X_train)
X_train_scaled = X_scaler.transform(X_train)
X_test_scaled = X_scaler.transform(X_test)

In [32]:
X_train_scaled

array([[-0.96884108, -0.02457427,  0.38198016, ..., -1.14267625,
        -1.55778808, -0.71678178],
       [-0.96884108,  0.76731049, -2.11362357, ..., -2.11444129,
        -1.55778808,  0.58013155],
       [-0.96884108, -1.6083438 ,  0.38198016, ..., -0.17091121,
         0.09926755, -1.36523845],
       ...,
       [-0.96884108, -0.81645904, -1.28175566, ..., -0.17091121,
        -0.72926027, -0.06832512],
       [ 1.03216103, -1.7403246 , -2.11362357, ...,  0.80085383,
         1.75632318, -1.36523845],
       [-0.96884108,  0.6353297 , -2.11362357, ..., -0.17091121,
        -0.72926027,  0.58013155]])

In [33]:
# Random Forest Classifier
rfc = RandomForestClassifier(n_estimators=128, random_state=78)

rfc.fit(X_train_scaled, y_train)

RandomForestClassifier(n_estimators=128, random_state=78)

In [34]:
rfc_predictions = rfc.predict(X_test_scaled)

In [35]:
accuracy_score(y_test, rfc_predictions)

0.6499312242090785

In [36]:
confusion_matrix(y_test, rfc_predictions)

array([[166,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0],
       [  0, 287,   0,   0,   0,   0,  60,   0,   0,   0,   0,   0,   0],
       [  0,   0, 209,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0],
       [  0,   0,   0, 166,   0,   0,   0,   0,  78,   0,   0,   0,   0],
       [  0,   0,   0,   0, 281,  74,   0,   0,   0,   0,  23,   0,  38],
       [  0,   0,   0,   0, 150,  32,   0,   0,   0,   0,  10,   0,  24],
       [  0, 154,   0,   0,   0,   0,  38,   0,   0,   0,   0,   0,   0],
       [  0,   0,   0,   0,   0,   0,   0, 262,   0,   0,   0,   0,   0],
       [  0,   0,   0, 129,   0,   0,   0,   0,  66,   0,   0,   0,   0],
       [  0,   0,   0,   0,   0,   0,   0,   0,   0,  84,   0,   0,   0],
       [  0,   0,   0,   0,  91,  13,   0,   0,   0,   0,   4,   0,  12],
       [  0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0, 282,   0],
       [  0,   0,   0,   0, 127,  23,   0,   0,   0,   0,  12,   0,  13]])

In [37]:
print(classification_report(y_test, rfc_predictions))

              precision    recall  f1-score   support

           1       1.00      1.00      1.00       166
           2       0.65      0.83      0.73       347
           3       1.00      1.00      1.00       209
           4       0.56      0.68      0.62       244
           5       0.43      0.68      0.53       416
           6       0.23      0.15      0.18       216
           7       0.39      0.20      0.26       192
           8       1.00      1.00      1.00       262
           9       0.46      0.34      0.39       195
          10       1.00      1.00      1.00        84
          11       0.08      0.03      0.05       120
          12       1.00      1.00      1.00       282
          13       0.15      0.07      0.10       175

    accuracy                           0.65      2908
   macro avg       0.61      0.61      0.60      2908
weighted avg       0.62      0.65      0.62      2908

In [38]:
importances = rfc.feature_importances_

In [39]:
importances

array([0.01680826, 0.13955983, 0.04640616, 0.079133  , 0.10395463,
       0.27571192, 0.2854345 , 0.05299169])